import java.io.BufferedReader;
import java.io.FileInputStream;
import java.io.InputStreamReader;

public class Filter{
	/*
	public static String[] stop={"JB","PK","SM","TMD","“一带一路”战略","一中各表","丢你老母","中、港、台","中、港、澳、台","中、澳、台",
	  		 "中华民国","中台合资","中国台湾","中港","中澳","乌克兰亲俄武装","乌克兰分裂分子","乌克兰民兵武装","买了个婊","乳交",
	  		 "令计划","你妈的","你妹","修宪","傻逼","党国","共党","共军","前苏联","北朝鲜",
	  		 "十字军","占中三子","反共","口交","吃翔","吉跋猫","呆逼","周永康","哇噻","回回",
	  		 "妈的","妈蛋","宪改","尖阁群岛","屁民","屌爆了","已撸","徐才厚","性交","性奴",
	  		 "性虐","我靠","撕逼","斯普拉特利群岛","新中囯成立前","新中囯成立后","新宪","日了狗","本屌","毛太祖",
	  		 "毛腊肉","法克鱿","浮尸国","淫家","滚粗","然并卵","爆菊","特么的","玛拉戈壁","疆独",
	  		 "碧池","碧莲","穆斯林世界","穆斯林国家","维族","维独","绿茶婊","肛交","肛门","草泥马",
	  		 "荣休主教","蒙族","薄熙来","蛋疼","蛮子","表砸","装13","装逼","解放前","解放后",
	  		 "达菲鸡","逗比","逼格","郭伯雄","金三胖","阴茎","阴蒂","阴道","阿拉伯民兵","鲜族",
	  		 "齐B短裙","鸡巴","颜射","乳射","打炮","撸管","..."};
	*/
	public static String[] stop={"JB","PK","SM","TMD","“一带一路”战略","一中各表","丢你老母","中、港、台","中、港、澳、台","中、澳、台",
	  		 "中华民国","中台合资","中国台湾","中港","中澳","乌克兰亲俄武装","乌克兰分裂分子","乌克兰民兵武装","买了个婊",
	  		 "令计划","你妈的","你妹","修宪","傻逼","党国","共党","共军","前苏联","北朝鲜",
	  		 "十字军","占中三子","反共","吃翔","吉跋猫","呆逼","周永康","哇噻","回回",
	  		 "妈的","妈蛋","宪改","尖阁群岛","屁民","屌爆了","已撸","徐才厚",
	  		 "我靠","撕逼","斯普拉特利群岛","新中囯成立前","新中囯成立后","新宪","日了狗","本屌","毛太祖",
	  		 "毛腊肉","法克鱿","浮尸国","淫家","滚粗","然并卵","特么的","玛拉戈壁","疆独",
	  		 "碧池","碧莲","穆斯林世界","穆斯林国家","维族","维独","绿茶婊","草泥马",
	  		 "荣休主教","蒙族","薄熙来","蛋疼","蛮子","表砸","装13","装逼","解放前","解放后",
	  		 "达菲鸡","逗比","逼格","郭伯雄","金三胖","阿拉伯民兵","鲜族",
	  		 "齐B短裙","鸡巴","撸管","..."};

	public static boolean isstop(String str){
		boolean isstop=false;
		for(String s:stop){
			if(str.contains(s)){
				isstop=true;
				break;
			}
		}
		return isstop;
	}
	
	public static void senStop(String file)throws Exception{
		BufferedReader br=new BufferedReader(new InputStreamReader(new FileInputStream(file),"UTF-8"));
		String line=null;
		while((line=br.readLine())!=null){
			try{
				if(isstop(line.split("\t")[1])){//0,1
					//System.out.println(line);
				}else{
					System.out.println(line);
				}
			}catch(Exception e){
				
			}
		}
		br.close();
	}
}